Repository: judealatawi/Wijha
Catalog: Bookmarked/Wijha App/*.lproj/Localizable.strings
Languages: ar

source: Category
ar: قائمة

source: Trending
ar: رائج

source: more
ar: المزيد

source: Latest
ar: الجديد

source: What is new in Riyadh
ar: ماهو جديد بالرياض

source: Nerd Cafe
ar: نيرد كوفي

source: Riaydh Front
ar: واجهة الرياض

source: Deep Brown
ar: ديب براون

source: Riyadh Park
ar: الرياض بارك

source: Playground
ar: ملعب اطفال

source: Boulevard
ar: بلوفارد

source: Knoll Library
ar: مكتبة نوول

source: BLANCA
ar: بلانكا

source: Welcome
ar: مرحبا
